Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: ས་བཅུ་པ་ལ་ནི་གང་དག་གཞན་ལ་གནས་པ་དེའི་མཚན་མ་བྱུང་བར་གྱུར་པ་དེ་དག་གི་ཆོས་དེ་ལ་ཕྱིན་ཅི་ལོག་མེད་པར་བལྟའོ། །
en: On the tenth bhūmi, they unmistakenly see the qualities of those who reside elsewhere and whose signs have not appeared.

source: ས་དང་པོ་དང་བདུན་པའི་བར་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རིག་པར་བྱའོ། །
en: You should recognize that the signs on the first to the seventh bhūmis may also be the activity of Māra.

source: གོང་མ་དག་ལ་ནི་བདུད་ཀྱི་བར་ཆད་བྱེད་པར་མི་ནུས་སོ། །
en: Past those bhūmis Māra has no power to create hindrances.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་འོད་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟ་སྟེ།
en: 17. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata’s radiance, consider those bodhisattvas to be on the third bhūmi.

source: དེས་ནི་གཞན་དག་གིས་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་བསླབ་པར་བྱའོ། །
en: They should train in fulfilling the wishes of others.

source: གལ་ཏེ་བརྩོན་འགྲུས་བྱས་ན་གཟུངས་ཐོབ་པར་འགྱུར་ཞིང་ས་བཅུ་པོ་ཐམས་ཅད་དུ་ཡང་འགྱུར་རོ། །
en: If they are diligent, they will obtain the power of dhāraṇī and reach any of the ten bhūmis. 18.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་ལ་མ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas hear the Tathāgata but do not see him, consider those bodhisattvas to be on the fourth bhūmi.

source: དེས་ནི་རྒྱལ་པོར་གྱུར་ཅིང་ལོངས་སྤྱོད་དང་ལྡན་པ་ན་སེམས་ཅན་རྣམས་སངས་རྒྱས་ལ་ལྟ་བ་དང་ཕྲལ་ཞིང་རབ་ཏུ་བྱུང་ནས་ཀྱང་གཡོས་ཆོས་ལ་དཔྱས་བྱས་པ་ཡིན་པས་དེས་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཟླ་བར་ཉིན་མཚན་དུ་གདོན་པར་བྱའོ། །
en: This indicates that when those bodhisattvas were wealthy kings they prevented beings from seeing the Buddha and, after renouncing, deceitfully criticized the Dharma. That being the case, such bodhisattvas should recite the Three Sections Dharma discourse day and night for a month.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡིན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་རིག་པར་བྱ་ཞིང་ས་དགུ་པའི་བར་དུ་རིག་པར་བྱ་སྟེ།
en: 19. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to have the form of the Tathāgata, recognize that those bodhisattvas are on the first bhūmi or are on one of the first nine bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་གཟུངས་བསྒྲུབ་པར་ནུས་ཤིང་ཏིང་ངེ་འཛིན་བསྒྲུབ་པར་ཡང་ནུས་ལ་མངོན་པར་ཤེས་པ་བསྒྲུབ་པར་ཡང་ནུས་སོ། །
en: Such bodhisattvas have the capacity to accomplish the power of dhāraṇī, samādhi, and the extrasensory cognitions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་སངས་རྒྱས་ཀྱང་དགོངས་པར་མཛད་པས་དེས་ཀྱང་སེམས་མཉམ་པར་བྱའོ། །
en: The Buddha will also think of those bodhisattvas, so they should cultivate even-mindedness.

source: དེས་ན་མྱུར་དུ་བྱང་ཆུབ་འགྲུབ་པར་འགྱུར་ཞིང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་ཡང་འགྱུར་རོ། །
en: Such bodhisattvas will quickly achieve awakening and become completely and perfectly awakened.

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་བཞེངས་པ་ལ་བསོད་སྙོམས་འབུལ་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see themselves giving alms to the Tathāgata while he stands, consider them to be on the first bhūmi.

source: གང་བཞུགས་པ་ལ་འབུལ་བ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they give alms to the Tathāgata while he sits, consider them to be on the second bhūmi.

source: གང་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་འབུལ་བ་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they give alms to the splendidly adorned Tathāgata, consider them to be on the third bhūmi.

source: གང་གཉེན་འདབ་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they give alms to the Tathāgata surrounded by his relatives, consider them to be on the fourth bhūmi.

source: གང་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they give alms to the Tathāgata surrounded by many people, consider them to be on the fifth bhūmi.

source: གང་སྐྱེ་བོ་གཉིས་གས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they give alms to the Tathāgata flanked by two people, consider them to be on the sixth bhūmi.

source: གང་བཀོད་པ་ཐམས་ཅད་ལ་སྙོམས་པར་ཞུགས་པ་ལ་འབུལ་བ་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they give alms to the Tathāgata resting in meditative composure in the midst of all displays, consider them to be on the seventh bhūmi.

source: གང་བསྟོད་པ་མཛད་པ་ལ་འབུལ་བ་དེ་ནི་ས་བརྒྱད་པར་རོ། །
en: If they give alms to the Tathāgata who is uttering praises, consider them to be on the eighth bhūmi.

source: གང་ཆོ་འཕྲུལ་མཛད་པ་ལ་འབུལ་བ་དེ་ནི་ས་དགུ་པར་ཏེ།
en: If they give alms to the Tathāgata while he is performing miracles, consider them to be on the ninth bhūmi.

source: ཐམས་ཅད་དུ་ཡང་བདུད་ཀྱི་ལས་ནི་རྟོགས་པར་བྱའོ། །
en: You should realize that all of these signs may also be the activity of Māra. 20.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་གམ། མེ་ཏོག་ཕྲེང་ངམ། སྤོས་སམ། ཙན་དན་གྱི་ཕྱེ་མ་དག་གསོལ་ལམ། །བྱུག་པས་སྐུད་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be the flowers, flower garlands, incense, or sandalwood powder presented to a caitya of the Tathāgata, or to be an unguent that anoints it, consider those bodhisattvas to be on one of the first five bhūmis.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལས་གལ་ཏེ་སད་པ་ན། སྦྱིན་པའི་མཚན་མ་དེ་དག་ཀྱང་དྲན་ཞིང་སྦྱིན་པ་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas were practicing the perfection of generosity, and upon waking could recall the signs of that generosity but did not feel conceit, consider them to be on the first bhūmi.

source: གལ་ཏེ་ཚུལ་ཁྲིམས་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they did not feel conceit about their discipline, consider them to be on the second bhūmi.

source: གལ་ཏེ་བཟོད་པ་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they did not feel conceit about their patience, consider them to be on the third bhūmi.

source: གལ་ཏེ་བརྩོན་འགྲུས་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་བཞི་པར་བལྟའོ། །
en: If they did not feel conceit about their diligence, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་བསམ་གཏན་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་ལྔ་པར་བལྟའོ། །
en: If they did not feel conceit about their meditation, consider them to be on the fifth bhūmi.

source: དེས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱ་སྟེ།
en: They should also have no hostility toward any being.

source: དེས་ན་མྱུར་བ་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་གནོན་པར་འགྱུར་རོ། །
en: Thus will they swiftly arrive at the level of nonregression. 21.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ན་བཟའ་དྲི་མ་ཅན་གསོལ་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་སྟེ། ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata wearing dirty clothes, consider those bodhisattvas to have great karmic obscurations and to be on one of the first four bhūmis.

source: གལ་ཏེ་དེ་ལ་ཤིན་ཏུ་གནོད་པ་བྱེད་པའི་རྐྱེན་མི་འདོད་པ་དག་འབྱུང་བར་འགྱུར་ན་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas experience extremely harmful unwanted circumstances, consider them to be on the first bhūmi.

source: གལ་ཏེ་འདྲེན་མར་འབྱུང་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they experience mixed circumstances, consider them to be on the second bhūmi.

source: གལ་ཏེ་ལུས་ཀྱིས་འབྱུང་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they experience them physically, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་སེམས་ཀྱིས་འབྱུང་ན་ས་བཞི་པར་བལྟའོ། །
en: If they experience them mentally, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་རྨི་ལམ་ན་བདག་ལ་བདག་གནོད་པ་བྱེད་ན་དེ་ནི་ས་ལྔ་བར་བལྟའོ། །
en: If they harm themselves in a dream, consider them to be on the fifth bhūmi.

source: ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་ཐ་ན་རྨི་ལམ་ན་ཡང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མྱོང་བ་མེད་དོ། །
en: Perfected bodhisattvas do not experience any ripening of their karma in their dreams.

source: དེས་མངོན་པའི་ང་རྒྱལ་མེད་པར་བྱ་ཞིང་ཕྲག་དོག་མེད་པར་སེམས་ཅན་རྣམས་ཀྱང་གཞན་མཆོད་པ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ། དེས་ཡང་དང་ཡང་དུ་ཕུང་པོ་གསུམ་པའི་མདོ་སྡེ་ཡང་ཁ་ཏོན་དུ་བྱ་སྟེ།
en: Therefore, such bodhisattvas should eliminate excessive pride, encourage other beings to make offerings without feeling jealous, and repeatedly recite the Three Sections discourse.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་ཐོས་པའི་ཆོས་དག་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་དང་། ཆོས་སྨྲ་བའི་གང་ཟག་མང་པོ་དག་ལ་ཡང་བསྙེན་བཀུར་བྱས་པ་ཡིན་བར་རིག་པར་བྱ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas hear teachings that have never been heard before, recognize that those bodhisattvas have revered many buddhas, as well as many people who teach the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བར་བལྟའོ། །
en: Consider those bodhisattvas to be on one of the first seven bhūmis.

source: དེས་ནི་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པར་བྱ་སྟེ། དེས་ནི་མྱུར་བ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: Such bodhisattvas should act in the manner they have been taught, and they will then swiftly find release in awakening.

source: གལ་ཏེ་ཆོས་ཀྱི་གཏམ་སྣ་ཚོགས་དག་ཐོས་ན་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas hear various kinds of Dharma advice, consider them to be on the first bhūmi.

source: གལ་ཏེ་ཡོ་བྱད་བསྙུངས་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they receive advice on needing few possessions, consider them to be on the second bhūmi.

source: གལ་ཏེ་ཐེ་ཚོམ་གཅོད་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they receive advice on removing doubts, consider them to be on the third bhūmi.

source: གལ་ཏེ་གཟུངས་ཀྱི་གཏམ་དག་ཐོས་ན་ནི་ས་བཞི་བར་བལྟའོ། །
en: If they receive advice on dhāraṇīs, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་མཚན་ཉིད་ཀྱི་གཏམ་དག་ཐོས་ན་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they receive advice on characteristics, consider them to be on the fifth bhūmi.

source: གལ་ཏེ་དོན་དམ་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they receive advice on the ultimate, consider them to be on the sixth bhūmi.

source: གལ་ཏེ་གཏམ་ཐམས་ཅད་ཐོས་ན་ནི་ས་བདུན་པར་བལྟ་སྟེ།
en: If they receive every kind of advice, consider them to be on the seventh bhūmi.

source: ས་དང་ས་དག་ལ་དེ་ལྟར་ཤེས་པར་བྱ་ཞིང་ལས་ཀྱི་སྒྲིབ་པ་དག་ཀྱང་རྟོགས་པར་བྱའོ། །
en: This is how to understand each of the bhūmis and to recognize karmic obscurations. 23.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མ་བསྟན་པའི་ཆོས་དག་ཤེས་ལ། །དེས་སད་ན་མི་ཤེས་ན་དེས་ནི་ཆོས་ལ་སྒྲིབ་པའི་ལས་བྱས་ཤིང་ཟང་ཟིང་དང་བཅས་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཡིན་པས།
en: “Vajrapramardin, if in a dream bodhisattvas understand Dharma teachings that were not taught, but upon waking no longer understand them, then those bodhisattvas have created karma that obscures the Dharma and have given the gift of Dharma mixed with material concerns.

source: དེས་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱ་ཞིང་དངོས་པོ་ཐམས་ཅད་མི་བསྲི་བར་ཆོས་སྨྲ་བ་དག་ལ་དབུལ་བར་བྱའོ། །
en: That being the case, those bodhisattvas should venerate Dharma teachers and present them with offerings of all their material goods without holding back.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: Consider such bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་རྨི་ལམ་ན་ཆོས་ཐོས་ནས་སད་ནས་མ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas hear the Dharma in a dream but upon waking do not see anything, consider them to be on the first bhūmi.

source: གལ་ཏེ་སད་ནས་ཀྱང་མ་བརྗེད་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If upon waking they have not forgotten, consider them to be on the second bhūmi.

source: གང་ལ་ཉམས་པར་མི་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལུང་བསྟན་པའི་ཆོས་ཅན་ཡིན་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་དང་ལྡན་པར་ཡང་བལྟ་སྟེ།
en: Consider bodhisattvas who never falter to have received a prediction and to have mastered the six perfections.

source: ས་གཞན་དག་གི་བར་ན་གནས་པས་ནི་བཟུང་ནས་མི་ཉམས་ཤིང་ཉམས་པར་ཡང་མི་འགྱུར་རོ། །
en: Bodhisattvas on the other bhūmis do not lose what they have grasped and do not falter in any way.

source: དེས་ལས་ཀྱི་སྒྲིབ་པ་དང་བདུད་ཀྱི་ལས་དག་ཀྱང་རྟོགས་པར་བྱའོ། །
en: Thus, these signs can also be recognized as karmic obscurations or the activity of Māra. 24.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་དགེ་སློང་ཆོས་སྨྲ་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསམས་པ་ཡིན་ཞིང་དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་དང་། བདུད་ཀྱི་ལས་ཆུང་བར་རིག་པར་བྱའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see a Dharma-teaching monk they have never seen before, recognize that those bodhisattvas are in the thoughts of other bodhisattvas, have few karmic obscurations, and are little affected by the activity of Māra.

source: གལ་ཏེ་བརྩོན་འགྲུས་བྱས་ན་སྣང་བ་ཐོབ་པར་ཡང་འགྱུར་ཏེ།
en: If those bodhisattvas are diligent, they will also attain illumination.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider such bodhisattvas to be on one of the first six bhūmis.

source: གལ་ཏེ་ཚིགས་སུ་བཅད་པའི་སྡེ་སྨྲ་ལ་མདོའི་སྡེ་མ་ཡིན་ན་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If the monk is teaching the verses section but not the sūtra section, consider them to be on the first bhūmi.

source: གལ་ཏེ་མདོའི་སྡེ་སྨྲ་ན་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If the monk is teaching the sūtra section, consider those bodhisattvas to be on the second bhūmi.

source: གལ་ཏེ་ཚིགས་སུ་བཅད་པའི་སྡེ་དང་མདོའི་སྡེ་སྨྲ་ན་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If the monk is teaching the verses section and the sūtra section, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་སྣ་ཚོགས་སྨྲ་ན་ནི་ས་བཞི་པར་བལྟའོ། །
en: If the monk is teaching various sections, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་ཟབ་མོ་སྨྲ་ན་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If the monk is teaching the profound, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་སོ་སོ་ཡང་དག་པར་རིག་པ་སྨྲ་ན་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If the monk is teaching the discernments, consider those bodhisattvas to be on the sixth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཆོས་ཀྱི་ཁྲི་སྟན་ལ་འདུག་སྟེ་ཆོས་སྟོན་པར་ཀུན་ཏུ་ཤེས་ན་དེས་ནི་སྔོན་གྱི་སངས་རྒྱས་རྣམས་ཀྱི་ཁྲི་སྟན་བཤམས་ཤིང་བདག་ཉིད་ཀྱིས་བཤམས་པ་ཡིན་ཏེ།
en: 25. “Vajrapramardin, if in a dream bodhisattvas perceive themselves sitting atop a Dharma throne teaching the Dharma, it indicates that they had prepared a Dharma throne for past buddhas, and did so themselves.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཟབ་མོ་ལ་བཟོད་པའི་སྣོད་དུ་གྱུར་ཅིང་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider such bodhisattvas to be suitable vessels to accept the profound, and to be on one of the first eight bhūmis.

source: གལ་ཏེ་མ་མགུ་བར་བྱས་ཏེ་སྟོན་ན་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas are giving teachings reluctantly, consider them to be on the first bhūmi.

source: གལ་ཏེ་མགུ་བར་བྱས་ཏེ་སྟོན་ན་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If giving them enthusiastically, consider them to be on the second bhūmi.

source: གལ་ཏེ་འབྲེལ་པར་སྟོན་ན་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If giving connected teachings, consider them to be on the third bhūmi.

source: གལ་ཏེ་རྒྱུན་རྗེས་སུ་འབྲེལ་པར་སྟོན་ན་ནི་ས་བཞི་པར་བལྟའོ། །
en: If giving sequential teachings, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་ཤེས་པ་ཆེན་པོའི་ཡུལ་སྟོན་ན་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If giving teachings on a topic of great knowledge, consider them to be on the fifth bhūmi.

source: གལ་ཏེ་ཉན་ཐོས་ཀྱི་ཡུལ་སྟོན་ན་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If giving teachings on a topic for śrāvakas, consider them to be on the sixth bhūmi.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་སྟོན་ན་ནི་ས་བདུན་པར་བལྟའོ། །
en: If giving teachings on a topic for bodhisattvas, consider them to be on the seventh bhūmi.

source: གལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་སྟོན་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བརྒྱད་པར་བལྟའོ། །
en: If giving teachings on a topic for buddhas, consider them to be on the eighth bhūmi. 26.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གནས་སུ་སོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ལས་རྣམ་པར་རྒལ་ཅིང་བདུད་ཀྱི་ལས་ལས་ཤིན་ཏུ་འདས་པ་ཡིན་ཏེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves having traveled somewhere, those bodhisattvas have overcome their karmic obscurations and are far beyond the reach of Māra’s activity.

source: ས་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider such bodhisattvas to be on one of the first nine bhūmis.

source: གང་མི་རྫི་བར་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas are somewhere free of danger, consider them be on the first bhūmi.

source: གང་ནོར་རྙེད་ཅིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they are in a place where riches can be found, consider them to be on the second bhūmi.

source: གང་ཆོས་རྙེད་ཅིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they are in a place where the Dharma can be found, consider them to be on the third bhūmi.

source: གང་དགེ་བའི་བཤེས་གཉེན་ལ་བལྟ་ཞིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they are in a place where they meet a spiritual guide, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་ཚུལ་བཞིན་གྱི་སེམས་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they are in a place with a proper motivation, consider them to be on the fifth bhūmi.

source: གང་ལུས་བདེ་བ་ཉིད་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they are in a place where they are in good physical health, consider them to be on the sixth bhūmi.

source: གང་སེམས་བདེ་བ་ཉིད་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they are in a place where they are in good mental health, consider them to be on the seventh bhūmi.

source: གང་མངོན་པར་ཤེས་པ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they are in a place where they have the extrasensory cognitions, consider them to be on the eighth bhūmi.

source: གང་ལུང་བསྟན་པ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they are in a place where they receive a prediction, consider them to be on the ninth bhūmi. 27.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཉེ་བ་སྟེ། ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the seat of awakening, consider those bodhisattvas to be close to a state of not regressing from awakening and to be on any one of the ten bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ནི་མཐོང་ལ་བྱང་ཆུབ་ཀྱི་ཤིང་མ་མཐོང་ན་དེ་ནི་ས་དང་པོ་བར་བལྟའོ། །
en: “If bodhisattvas see the seat of awakening but do not see the Bodhi tree, consider them to be on the first bhūmi.

source: གང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་ཡང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they also see the Bodhi tree, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་ཤིང་ལྗོན་པ་མང་པོས་ཡོངས་སུ་བསྐོར་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see it surrounded by many trees, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་ལོ་མ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see it has abundant leaves, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་མེ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see it has abundant flowers, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see it has abundant fruit, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་གདན་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see cushions arranged there, consider those bodhisattvas to be on the seventh bhūmi.

source: གང་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see the seat of awakening surrounded by people, consider those bodhisattvas to be on the eighth bhūmi.

source: གང་གིས་ཀླུས་ཡོངས་སུ་བསྐོར་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they see it surrounded by nāgas, consider those bodhisattvas to be on the ninth bhūmi.

source: གང་གིས་ལྷས་ཡོངས་སུ་བསྐོར་ཅིང་མེ་ཏོག་གིས་ཀྱང་གཏོར་ལ་ཨ་ལ་ལ་ཞེས་བྱ་བའི་སྒྲ་ཡང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟའོ། །
en: If they see it surrounded by gods, and hear those gods call out “How delightful!” while scattering flowers, consider those bodhisattvas to be on the tenth bhūmi. 28.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་འཆག་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་བརྙས་པར་བྱས་ཤིང་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཡིན་པས་དེ་ནི་བརྩོན་འགྲུས་དང་ལྡན་པས་གཞན་དག་གིས་ཡོངས་སུ་ཐོབ་པར་བྱ་བ་དང་། ཉེས་པར་མི་འཛིན་པ་ལ་སྤྲོ་བར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata walking, it indicates that those bodhisattvas had been disrespectful when giving the gift of the Dharma. Such bodhisattvas should therefore diligently take joy in the attainment of others and in not focusing on faults. Consider those bodhisattvas to be on one of the first seven bhūmis.

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་མི་མཛེས་པར་འཆག་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see the Tathāgata walking ungracefully, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་མཛེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see him walking gracefully, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་གདན་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see an arranged seat, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་བཞུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see him seated, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་ཤིང་ལྗོན་པས་ཡོངས་སུ་བསྐོར་བ་དང་བཅས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see him surrounded by trees, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་མེ་ཏོག་ཀུན་ཏུ་བཀྲམ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see flowers strewn about him, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་བླ་རེས་ཀུན་ནས་བཀབ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see him shaded by a canopy, consider those bodhisattvas to be on the seventh bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ལས་ཀྱི་སྒྲིབ་པ་ཡོངས་སུ་དག་པ་ཡིན་པར་བལྟའོ། །
en: 29. “Vajrapramardin, if in a dream bodhisattvas see the Tathāgata turning the wheel of Dharma, recognize that such bodhisattvas will never regress from any of the first seven bhūmis and that their karmic obscurations have been purified.

source: གང་གིས་གདན་མ་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see that a seat has not been arranged, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་གདན་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see that a seat has been arranged, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་གདན་སྣ་ཚོགས་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see that various seats have been arranged, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་གདན་ལ་མེ་ཏོག་མངོན་པར་བཀྲམ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see that the seat has been strewn with flowers, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་སྟེང་དུ་བླ་རེ་སྣ་ཚོགས་བྲེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་བར་བལྟའོ། །
en: If they see a variety of canopies suspended overhead, consider those bodhisattvas to be on the fifth bhūmi.
